#Введіть з клавіатури в масив п'ять цілочисельних значень. Виведіть їх в один рядок через кому. Отримайте для масиву середнє арифметичне.Виконав студент групи 122-Д Наральник Богдан
import numpy as np
arr = np.zeros(5, dtype=int) #Заповнюємо масив нулями типу int
for i in range(len(arr)):
    arr[i] = int(input(f'Елемент №{i + 1} = ')) #вводимо елементи в масив
    print(f'{", ".join((map(str, arr)))}\nСереднє арифметичне = {np.mean(arr)}') #Виводмио елементи і обчислюєм середнє арефметичне за допомогою функції mean()
