#Дані про температуру води на Чорноморському узбережжі за декаду вересня зберігаються в масиві. Визначити, скільки за цей час було днів, придатних для купання.
#Виконав студент групи 122-Д Наральник Богдан
import numpy as np
arr = np.zeros(10, dtype=int)#заповнюєм масив нулями типу int
count = 0
for i in range(len(arr)):#користувач вводить дані про температуру
    arr[i] = int(input(f'День №{i + 1}: '))
    if (arr[i] >= 22) and (arr[i] <= 24):#знаходимо числа що належать діапазону та їх кількість
        count += 1
print(f'Дні для купання: {count}')
