#Знайти добуток елементів масиву цілих чисел, які кратні 7. Розмірність масиву - 15. Заповнення масиву здійснити випадковими числами від 10 до 50.
#Виконав студент групи 122-Д Наральник Богдан
import numpy as np
import random
arr = np.zeros(15, dtype=int)# Заповнюємо масив нулями типу int.
product = 1
for i in range(len(arr)):#масив з рандомними числами від 10 до 50
    arr[i] = random.randint(10, 50)
    if arr[i] % 7 == 0:#добуток елементів масиву, які кратні 7
        product *= arr[i]
print(f'Масив елементів:{arr}\nДобуток елементів, які кратні 7: {product}')
