#Знайти добуток всіх елементів масиву цілих чисел, менших 0. Розмірність масиву - 10. Заповнення масиву здійснити за допомогою клавіатури.
#Виконав студент групи 122-Д Наральник Богдан
import numpy as np
arr = np.zeros(10, dtype=int)#заповнюємо масив нулями типу int
product = 1
for i in range(len(arr)):#вводимо елементи в масив
    arr[i] = int(input(f'Елемент №{i + 1} = '))
    if arr[i] < 0:#знаходиом числа, які менші за 0 та множимо їх
        product *= arr[i]
print(f'Масив елементів:{arr}')#виводим на екран
if product == 1.0:
    print('В масиві немає чисел, менших 0. Добуток знайти неможливо!')
else:
    print(f'Добуток елементів, які менші нуля: {product}')
