#Знайти суму всіх елементів масиву цілих чисел що задовольняють умові:остача від ділення на 2 дорівнює 3. Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами від 200 до 300.
#Виконав студент групи 122-Д Наральник Богдан
import numpy as np
import random
arr = np.zeros(20, dtype=int)#заповнюємо масив нулями типу int
total = 0
for i in range(len(arr)):#заповнюємо рандомними числами від 200 до 300
    arr[i] = random.randint(200, 300)
    if arr[i] % 2 == 3:#знаходимо суму елементів масиву
        total += arr[i]
print(f'Масив елементів:{arr}\nСума елементів, у яких остача від ділення на 2 дорівнює 3: {total}')#виводимо на екран

