#Знайти добуток всіх елементів масиву дійсних чисел, менших заданого числа. Розмірність масиву - 10. Заповнення масиву здійснити випадковими числами від 50 до 100
#Виконав студент групи 122-Д Наральник Богдан
import numpy as np
import random
arr = np.zeros(10, dtype=int)#заповнюємо масив нулями типу int
product = 1.
number = int(input('Введіть число'))#вводимо число
for i in range(len(arr)):#заповнюєм масив рандомними числами від 50 до 100
    arr[i] = random.randint(50, 100)
    if arr[i] < number:#Знаходимо числа,які менші тих, що ввім користувач і перемножуємо їх
        product *= arr[i]
print(f'Масив елементів:{arr}')#виводимо на екран
if product == 1.0:
    print(f'Числа, які менші за задане число в масиві немає.')
else:
    print(f'Добуток чисел, які менші за {number}: {product}')

