#Знайти добуток елементів масиву, кратних 3 і 9. Розмірність масиву - 10.Заповнення масиву здійснити випадковими числами від 5 до 500.
#Виконав студент групи 122-Д Наральник Богдан
import numpy as np
import random
arr = np.zeros(10, dtype=int)#заповнюємо масив нулями типу int
product = 1
for i in range(len(arr)):#заповнюємо масив рандомними числами від 5 до 500
    arr[i] = random.randint(5, 500)
    if (arr[i] % 3 == 0) and (arr[i] % 9 == 0):#знаходимо числа які кратні 3 і 9 і перемножаєм їх
        product *= arr[i]
print(f'Масив елементів:{arr}')
if product == 1.0:
    print(f'Числа,які кратні 3 і 9 в масиві немає.')
else:
    print(f'Добуток чисел, які кратні 3 і 9: {product}')
