#Знайти суму всіх елементів масиву цілих чисел, які менше середнього арифметичного елементів масиву. Розмірність масиву - 20. Заповнення масиву здійснити випадковими числами від 150 до 300.
#Виконав студент групи 122-Д Наральник Богдан
from random import randint
c=0
g=0
e=list()
for a in range(20):#діапазон чисел
    b=randint(150,300)#рандомні числа
    c=c+b
    e.append(b)#робимо масив
d=c/20#середнє арифметичне
for f in range(20):#перевіряєм масив ще раз
    if e[f]<d:#порівнюєм
        g=g+e[f]#сума
print(g)

