#Напишіть програму аналізу значень температури хворого за добу:визначте мінімальне і максимальне значення, середнє арифметичне. Заміри температури виробляються шість раз на добу і результати вводяться з клавіатури у масив T.
#Виконав студент групи 122-Д Наральник Богдан
c=999
d=-999
e=0
for a in range(6):#діапазон чисел
    b=int(input())#вводимо значення
    if b<c:
        c=b#умова, якщо температура мінімальна
    if b>d:
        d=b#умова, якщо температура максимальна
    e=b+e#сума чисел, яка повинна поділитися на 6
print('min:')#Виводимо значення
print(c)
print('max:')
print(d)
print('avarage:')
print(e/6)
