#Лінійний масив містить відомості про кількість опадів, що випали за кожен з 12 місяців одного року. Складіть програму, що визначає загальну кількість опадів протягом цього року, середньомісячну кількість опадів, кількість посушливих місяців (коли кількість опадів було менше 30 мм), найпосушливіший місяць року.
#Виконав студент групи 122-Д Наральник Богдан
e=0
d=0
for a in range(12):#діапазон чисел
    b=int(input())#вводимо значення
    if b<30:
        d+=1
    e=b+e#сума чисел
print('Посушливий:')
print(d)
print('Цілий рік:')
print(e)
print('Середня кількість:')
print(e/12)



