#Дано два лінійних масиву однакової розмірності. Скласти третій масив з добутку елементів перших двох масивів, що стоять на місцях з однаковим індексом.
#Виконав студент групи 122-Д Наральник Богдан
d=list()
a=[1,1,2,3,6]
b=[1,1,4,8,32]
for c in range(len(a)):#діапазон
    d.append(a[c]*b[c])#множення по індексу
print(d)
