#Дані про температуру повітря і кількості опадів за декаду квітня зберігаються в масивах. Визначити кількість опадів, що випали у вигляді дощу і у вигляді снігу за цю декаду.
#Виконав студент групи 122-Д Наральник Богдан
d=0
e=0
for a in range(10):#діапазон  
    b=int(input('температура'))#вводимо температуру
    c=int(input('к-ть опадіть'))#вводимо опади
    if b<0:
        d=c+d#якщо виконується ця умова, то буде йти сніг
    else:
        e=c+e#якщо ця, то сніг
print('сніг')
print(d)
print()
print('дощ')
print(e)
