#Змінній t привласнити значення істина, якщо максимальний елемент одновимірного масиву єдиний і не перевищує наперед заданого числа а.
#Виконав студент групи 122-Д Наральник богдан
import numpy as np
import random
arr = np.zeros(10, dtype=int)
t,count = False,0 #присвоюєм змінній t значення False, а лічильнику повторень максимального елемента значення нуль
for i in range(len(arr)):#заповнюєм масив рандомними числами від 0 до 10
    arr[i] = random.randint(0, 10)
print(f'Одновимірний масив:{arr}')#виводимо масив
a = int(input('Введіть число: '))#вводимо число
for i in range(len(arr)):#Тут перевіряєм, скільки разів повторюєтсья максимальний елемент у масиві
    if arr[i] == max(arr):
        count += 1#К-ть повторень максимального елемента в одновимірному масиві.
if (max(arr) <= a) and (count == 1):
    t = True
print(f'Значення змінної: {t}')
