#Дан одновимірний масив а. Сформувати новий масив, який складається тільки з тих елементів масиву а, які перевищують свій номер на 10. Якщо таких елементів немає, то видати повідомлення.
#Виконав студент групи 122-Д Наральник Богдан
a=[1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17]
b=a[10:]
if b==[]:#Якщо елементи відсутні, то це пустий список
    print('Такі елементи відсутні')
else:#в іншому випадку видаємо результат
    print(b)

