#У будинку, що складається з 30 квартир, переселити мешканців так, щоб мешканці першої квартири переїхали в тридцяту, з тридцятого - в першу, з другої - в 29 і т.д., знайдіть кількість квартир, в яких проживає більше 5 осіб
#Виконав стдент групи 122-Д Наральник Богдан
import random
c=list()
e=list()
g=0
for a in range(30):#
    b=random.randint(1,7)#створюємо масив
    c.append(b)#
for d in range(29,-1,-1):
    e.append(c[d])
print(c)#початковий 
print(e)#кінцевий
for f in range(30):#рахуємо квартири в яких більше 5
    if e[f]>=5:
        g+=1
print(g)

