#Створіть цілочисельний масив А [1..15] за допомогою генератора випадкових чисел з елементами від -15 до 30 і виведіть його на екран. Визначте найбільший елемент масиву і його індекс
#Виконав студент групи 122-Д Наральник Богдан
import numpy as np
import random
A = np.zeros(15, dtype=int)#заповнюємо масив нулями типу int
for i in range(len(A)):
    A[i] = random.randint(-15, 30)#Заповнюємо масив рандомними числами від -15 до 30
print(f'Масив з елементами:{A}\nНайбільший елемент: {max(A)}\nЙого індекс: {np.where(A == max(A))[0][0]}')#Знаходимо найбільший елемент за тай ого індекс та виводимо
